# SQL en Python: Gestion BD (I)

La gestión de Bases de Datos es un mundo muy amplio que no podemos abarcar en un sprint y mucho menos en un par de píldoras, pero sí es bueno por lo menos que conozcas cómo con SQL (y para el gestor Sqlite3) se pueden hacer acciones tales como:

- Insertes, Updates y Deletes en las tablas
- Crear y Tirar Tablas
- Usar vistas

Que son los puntos que vamos a tratar aunque no necesariamente en ese orden, de hecho empezaremos creando nuestra base de datos y luego las tablas dentro de ellas

## Creación de Bases de Datos y tablas

Podemos crear nuestras propias bases de datos utilizando SQLite (que no es directamente trasladable a otros gestores) y luego dentro crearemos tablas usando ya sí sintaxis SQL. Nos importamos nuestras librerías y comenzamos a trabajar:

In [1]:
import pandas as pd
import sqlite3

Ahora haremos una conexión a una base de datos que en realidad no existe, pero esa es la forma de crearla:

In [2]:
connection = sqlite3.connect("base_de_datos_I.db")

In [3]:
cursor_gestion = connection.cursor()

Y ahora ya podemos crear una tabla siguiendo la siguiente sintaxis:

```sql

CREATE TABLE nombre_tabla (
    columnal tipo_de_dato restrictions,
    columna2 tipo_de_dato restrictions,
    ...
    columnaN tipo_de_dato restrictions
)

Donde:

- **nombre_tabla:** Es el nombre de la tabla que queremos crear.
- **columna1, columna2, ..., columnaN:** Son los nombres de las columnas de la tabla.
- **tipo_de_dato:** Es el tipo de dato de cada columna (por ejemplo, INT para enteros, VARCHAR o CHAR para cadenas de texto, DATE para fechas, etc.).
- **restricciones:** Son las restricciones o reglas para cada columna (opcional). Algunas restricciones comunes incluyen PRIMARY KEY , NOT NULL , UNIQUE , FOREIGN KEY , etc. (que corresponden a un índice único, a que no puede dejarse vacío el campo, a que no puede repetirse o a que tendrá que enlazarse con la clave en otra tabla)m

In [5]:
query_create = '''
CREATE TABLE Master_Class_2 (
ID    INT PRIMARY KEY, -- nombre tipo_de_dato restricción como hemos visto antes
NOMBRE    TEXT NOT NULL,
EDAD    INT NOT NULL,
CIUDAD    CHARS(50), -- Le decimos que este campo siempre tiene 50 caracteres
NOTAS    FLOAT
)
'''
cursor_gestion.execute(query_create)

Y una vez la tenemos, buscamos en la tabla maestra

In [6]:
query = "SELECT * FROM sqlite_master WHERE type == 'table'"
cursor_gestion.execute(query)
cursor_gestion.fetchall()

[('table',
  'Master_Class',
  'Master_Class',
  2,
  'CREATE TABLE Master_Class (\nID    INT PRIMARY KEY, -- nombre tipo_de_dato restricción como hemos visto antes\nNOMBRE    TEXT NOT NULL,\nEDAD    INT NOT NULL,\nCTLDAD    CHARS(50), -- Le decimos que este campo siempre tiene 50 caracteres\nNOTAS    FLOAT\n)'),
 ('table',
  'Master_Class_2',
  'Master_Class_2',
  4,
  'CREATE TABLE Master_Class_2 (\nID    INT PRIMARY KEY, -- nombre tipo_de_dato restricción como hemos visto antes\nNOMBRE    TEXT NOT NULL,\nEDAD    INT NOT NULL,\nCIUDAD    CHARS(50), -- Le decimos que este campo siempre tiene 50 caracteres\nNOTAS    FLOAT\n)')]

## Insert

Ahora que tenemos una tabla podemos ingestar registros (nombre técnico), modificarlos y borrarlos tal como vimos de forma teórica hace ya unas cuantas sesiones. En esta píldora trataremos el insert y dejaremos update y delete para la próxima.

Recordemos la sintaxis de un insert:

```sql

INSERT INTO nombre_tabla (columnal, columna2, columna3, ...)
VALUES (valor1, valor2, valor3, ...)

Donde:

- **nombre_tabla**: Nombre de la tabla donde se insertarán los datos.
- **columna1, columna2, ...** : Las columnas de la tabla en las que se insertarán los datos. No es necesario incluir todas las columnas, especialmente si algunas tienen valores predeterminados o son autoincrementables.
- **valor1, valor2, ...** : Los valores correspondientes a las columnas especificadas. Deben estar en el mismo orden que las columnas y deben ser del tipo de dato adecuado para cada columna.

### Insertemos unos cuantos valores:

- Luis, 24, Madrid, 8.5  
- Ana, 32, Lugo, 6.25  
- Juan, 35, Bilbao, 5.55  
- Nuria, 41, Alicante, 9.75

In [7]:
# Usa este diccionario para no ir valor a valor:
datos = {
    "Luis": (24,"Madrid", 8.5),  
    "Ana": (32,"Lugo", 6.25),  
    "Juan": (35, "Bilbao", 5.55),  
    "Nuria": (51, "Alicante", 9.75)}

for indice,(nombre,valores) in enumerate(datos.items()):
    edad = valores[0]
    ciudad = valores[1]
    nota = valores[2]
    query = f"INSERT INTO Master_Class_2 (ID, NOMBRE, EDAD, CIUDAD, NOTAS) VALUES ({indice},'{nombre}',{edad},'{ciudad}',{nota})"
    cursor_gestion.execute(query)

Y, esto es importante, ahora es necesario hacer algo que no habíamos hecho hasta ahora, y que se parece a lo que hacemos con los repos, hay que confirmarle a nuestro gestor que queremos hacer los cambios:

In [8]:
connection.commit()

In [12]:
query = '''
SELECT *
FROM Master_Class_2
'''
df = pd.read_sql(query, connection)

In [13]:
df

   ID NOMBRE  EDAD    CIUDAD  NOTAS
0   0   Luis    24    Madrid   8.50
1   1    Ana    32      Lugo   6.25
2   2   Juan    35    Bilbao   5.55
3   3  Nuria    51  Alicante   9.75

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      4 non-null      int64
 1   NOMBRE  4 non-null      object
 2   EDAD    4 non-null      int64
 3   CIUDAD  4 non-null      object
 4   NOTAS   4 non-null      float64
dtypes: float64(1), int64(2), object(2)
memory usage: 292.0+ bytes

In [15]:
connection.close()

# SQL en Python: Gestion BD (II)

En esta sesión completamos nuestra pequeña inmersión en el mundo del SQL y las bases de datos relacionales. Lo primero es volver a crearnos nuestra base de datos de la sesión anterior. Aquí te dejo las celdas preparadas:

In [16]:
import pandas as pd
import sqlite3

connection = sqlite3.connect("gestion_sesion.db")

cursor_gestion = connection.cursor()

In [18]:
query_create = '''

CREATE TABLE Master_Class (
ID    INT PRIMARY KEY, -- nombre tipo_de_dato restricción como hemos visto antes
NOMBRE   TEXT NOT NULL,
EDAD    INT NOT NULL,
CIUDAD  CHARS(50), -- Le decimos que este campo siempre tiene 50 caracteres, y los que
NOTAS   FLOAT
)
'''
cursor_gestion.execute(query_create)

In [20]:
# Usa este diccionario para no ir valor a valor:
datos = {
    "Luis": (24,"Madrid", 8.5),  
    "Ana": (32,"Lugo", 6.25),  
    "Juan": (35, "Bilbao", 5.55),  
    "Nuria": (51, "Alicante", 9.75)}

for indice,(nombre,valores) in enumerate(datos.items()):
    edad = valores[0]
    ciudad = valores[1]
    nota = valores[2]
    query = f"INSERT INTO Master_Class (ID, NOMBRE, EDAD, CIUDAD, NOTAS) VALUES ({indice},'{nombre}',{edad},'{ciudad}',{nota})"
    cursor_gestion.execute(query)

In [21]:
connection.commit()

## Update

La sintaxis general de UPDATE es:

```sql

UPDATE nombre_table  
SET columnal = _valor1, columna2 = valor2, ...  
WHERE condicion;
```

 * nombre_table:Es el nombre de la tabla donde se realizarán las modificaciones.
 * SET columnal = valor1, columna2 = valor2, ...** : Aquí se listan las columnas que se van a actualizar y los nuevos valores que se les asignarán. Puedes actualizar una o varias columnas a la vez.
 * WHERE condition:** Especifica qué registros deben ser actualizados. La condición puede ser cualquier expresión lógica válida. Si omites la cláusula WHERE, todos los registros en la tabla

Modifiquemos en nuestra tabla la edad de Nuria por 48 y comprobemos el resultado utilizando

read_sql

In [22]:
query = '''

UPDATE Master_Class
SET edad = 48
WHERE nombre = "Nuria"
'''

cursor_gestion.execute(query)

pd.read_sql("SELECT * FROM Master_Class", connection)

   ID NOMBRE  EDAD    CIUDAD  NOTAS
0   0   Luis    24    Madrid   8.50
1   1    Ana    32      Lugo   6.25
2   2   Juan    35    Bilbao   5.55
3   3  Nuria    48  Alicante   9.75

Pero ojo no nos dejemos engañar, necesitamos hacer el commit igualmente para que el cambio se grabe en la base de datos:

In [24]:
connection.commit()

## Delete

DELETE nos permite borrar filas de las tablas, y sigue esta sintaxis:

**DELETE FROM nombre_tabla WHERE condition;**

- **nombre_tabla:** Es el nombre de la tabla de la cual se eliminarán los registros.
- **condicion:** Especifica qué registros deben ser eliminados. Puede ser cualquier expresión lógica válida.

Si omites la cláusula WHERE en una instrucción DELETE, todos los registros de la tabla especificada serán eliminados, lo cual debe hacerse con precaución.

In [25]:
# Borremos las filas de los alumnos con menos de un 7:

In [27]:
query = '''

DELETE FROM Master_Class'''

cursor_gestion.execute(query)

In [28]:
pd.read_sql("SELECT * FROM Master_Class",connection)

Empty DataFrame
Columns: [ID, NOMBRE, EDAD, CIUDAD, NOTAS]
Index: []

En, que susto, tranquilidad, como con INSERT y UPDATE es necesario hacer el commit para que los cambios se hagan efectivos. En este caso cierra la conexión a la base de datos y abre una nueva.